Q1. You are given a dataset named employee_data with columns 'Name', 'Age', 'Salary', and 'Department'. How would you select and display the names of employees who are older than 30 and work in the 'Sales' department?

In [4]:
# Sample Data
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [32, 28, 35],
        'Salary': [60000, 75000, 90000],
        'Department': ['Sales', 'IT', 'Sales']}

employee_data = pd.DataFrame(data)

In [5]:
employee_data

      Name  Age  Salary Department
0    Alice   32   60000      Sales
1      Bob   28   75000         IT
2  Charlie   35   90000      Sales

In [6]:
employee_data[(employee_data['Age']>30) & (employee_data['Department']=='Sales')]

      Name  Age  Salary Department
0    Alice   32   60000      Sales
2  Charlie   35   90000      Sales

Q2. In a dataset named customer_data, there are missing values in the 'Income' column. How would you handle these missing values, and then create a new column 'Income_Category' that labels customers as 'Low', 'Medium', or 'High' income based on predefined thresholds?

In [7]:
# Sample Data
import pandas as pd
import numpy as np

data = {'CustomerID': [1, 2, 3, 4],
        'Income': [50000, np.nan, 75000, np.nan]}
customer_data = pd.DataFrame(data)

In [8]:
customer_data

   CustomerID   Income
0           1  50000.0
1           2      NaN
2           3  75000.0
3           4      NaN

In [12]:
customer_data['Income'].fillna(customer_data['Income'].mean(), inplace= True)

In [15]:
def cust_cat(income):
    if income<60000:
        return 'Low'
    elif (income>60000)&(income<80000):
        return "Medium"
    else:
        return 'High'

In [14]:
customer_data['Income_Category'] = customer_data['Income'].apply(cust_cat)

In [16]:
customer_data

   CustomerID   Income Income_Category
0           1  50000.0             Low
1           2  62500.0          Medium
2           3  75000.0          Medium
3           4  62500.0          Medium

Q3. Consider a DataFrame named order_data with columns 'Customer', 'Product', and 'Quantity'. How would you find the total quantity of each product sold, and then identify the product with the highest total sales?

In [17]:
# Sample Data
import pandas as pd

data = {'Customer': ['A', 'B', 'A', 'B', 'A'],
        'Product': ['X', 'Y', 'X', 'Y', 'Z'],
        'Quantity': [10, 5, 8, 12, 15]}
order_data = pd.DataFrame(data)

In [11]:
order_data

  Customer Product  Quantity
0        A       X        10
1        B       Y         5
2        A       X         8
3        B       Y        12
4        A       Z        15

In [18]:
total=order_data.groupby('Product')['Quantity'].sum()

In [19]:
total

Product
X    18
Y    17
Z    15
Name: Quantity, dtype: int64

In [20]:
total.idxmax()

'X'

Q4. You have two DataFrames, student_info with columns 'StudentID' and 'Name', and grades_info with columns 'StudentID' and 'Grade'. How would you merge these DataFrames to obtain a single DataFrame containing both student information and their grades?

In [21]:
# Sample Data
import pandas as pd

student_info = pd.DataFrame({'StudentID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
grades_info = pd.DataFrame({'StudentID': [2, 3, 4], 'Grade': [85, 90, 78]})

In [22]:
student_info

   StudentID     Name
0          1    Alice
1          2      Bob
2          3  Charlie

In [23]:
grades_info

   StudentID  Grade
0          2     85
1          3     90
2          4     78

In [24]:
pd.merge(student_info,grades_info,on='StudentID',how='outer')

   StudentID     Name  Grade
0          1    Alice    NaN
1          2      Bob   85.0
2          3  Charlie   90.0
3          4      NaN   78.0

Q5. Suppose you have a DataFrame named temperature_data with columns 'Timestamp' and 'Temperature'. How would you filter the data to include only temperatures above 25 degrees Celsius and then sort the results by timestamp?

In [25]:
# Sample Data
import pandas as pd

data = {'Timestamp': ['2023-01-01', '2023-01-02', '2023-01-03'],
        'Temperature': [28, 26, 30]}
temperature_data = pd.DataFrame(data)

In [26]:
temperature_data

    Timestamp  Temperature
0  2023-01-01           28
1  2023-01-02           26
2  2023-01-03           30

Q6. Given a DataFrame sales_data with columns 'Product' and 'Revenue', how would you calculate the total revenue for each product and then create a new column 'Revenue_Percentage' representing the percentage of total revenue that each product contributes?

In [28]:
# Sample Data
import pandas as pd

data = {'Product': ['A', 'B', 'C', 'A', 'B'],
        'Revenue': [1000, 1500, 800, 1200, 2000]}
sales_data = pd.DataFrame(data)

In [29]:
total_revenue=sales_data.groupby('Product')['Revenue'].sum()

In [30]:
sales_data.Revenue

0    1000
1    1500
2     800
3    1200
4    2000
Name: Revenue, dtype: int64

In [31]:
total_revenue[sales_data['Product']]

Product
A    2200
B    3500
C     800
A    2200
B    3500
Name: Revenue, dtype: int64

In [ ]:
sales_data['Product']

In [ ]:
total_revenue['A']

In [32]:
total_revenue[sales_data['Product']].values

array([2200, 3500,  800, 2200, 3500])

In [33]:
sales_data.Revenue/total_revenue[sales_data['Product']].values

0    0.454545
1    0.428571
2    1.000000
3    0.545455
4    0.571429
Name: Revenue, dtype: float64

Q7. You have a DataFrame named sensor_data with columns 'Timestamp', 'Sensor_A', and 'Sensor_B'. How would you calculate the average readings of both sensors for each day and identify the day with the highest combined average reading?

In [34]:
# Sample Data
import pandas as pd

data = {'Timestamp': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'],
        'Sensor_A': [20, 25, 18, 22],
        'Sensor_B': [15, 30, 20, 25]}
sensor_data = pd.DataFrame(data)

sensor_data

In [35]:
sensor_data['Timestamp']=pd.to_datetime(sensor_data['Timestamp'])

In [36]:
avg=sensor_data.groupby('Timestamp')[['Sensor_A','Sensor_B']].mean()

In [37]:
highest_avg=avg.sum(axis=1).idxmax()

In [38]:
avg.sum(axis=1).idxmax()

Timestamp('2023-01-01 00:00:00')

In [39]:
avg.sum(axis=1).idxmax().year

2023